import warmehaus from "../Images/warmehaus.png";
import grand_meyer from "../Images/grand_meyer.png";
import warmehaus_wh100 from "../Images/warmehaus_wh100.png";
import warmehaus_classic_wh700 from "../Images/warmehaus_classic_wh700.png";
import warmehaus_touchscreen from "../Images/warmehaus_touchscreen.png";
import warmehaus_basic_wh800 from "../Images/warmehaus_basic_wh800.png";
import warmehaus_wh400_pro from "../Images/warmehaus_wh400_pro.png";
import warmehaus_digital_wh900 from "../Images/warmehaus_digital_wh900.png";
import warmehaus_wh500_pro from "../Images/warmehaus_wh500_pro.png";
import warmehaus_wh1000_pro from "../Images/warmehaus_wh1000_pro.png";
import warmehaus_wh600_pro from "../Images/warmehaus_wh600_pro.png";
import warmehaus_digital_wh300 from "../Images/warmehaus_digital_wh300.png";
import warmehaus_mat_160w_standart_plus_0 from "../Images/warmehaus_mat_160w_standart_plus_0.png";
import warmehaus_mat_160w_standart_plus from "../Images/warmehaus_mat_160w_standart_plus.png";
import warmehaus_mat_200w_pro from "../Images/warmehaus_mat_200w_pro.jpg";
import warmehaus_mat_200w_pro_0 from "../Images/warmehaus_mat_200w_pro_0.png";
import grand_meyer_heatnwarm_econg150 from "../Images/grand_meyer_heatnwarm_econg150.png";
import grand_meyer_heatnwarm_econg150_0 from "../Images/grand_meyer_heatnwarm_econg150_0.png";
import grand_meyer_thc20 from "../Images/grand_meyer_thc20.png";
import grand_meyer_thc20_0 from "../Images/grand_meyer_thc20_0.png";
import post_0 from "../Images/post_0.jpg";
import post_1 from "../Images/post_1.png";
import post_2 from "../Images/post_2.jpg";

//id Должны быть уникальны!
export const postsData = [
  {
    id: 0,
    image: post_0,
    title: "Инфракрасная пленка",
    description: `Инфракрасная пленка — это система безопасного напольного или настенного отопления на основе карбоновой пленки. Применяется под сухие финишные покрытия под:

  ламинат
  линолеум
  ковролин
  и тд
  Укладывается на отражающий материал, непосредственно под финишное покрытие, без стяжки. Рекомендуется применять для основного и дополнительного подогрева поверхности пола, стен и потолков в сухих жилых, коммерческих и промышленных помещениях.
  
  Преимущества инфракрасной пленки:
  
  Экономичность
  Толщина пленки от 0,33 до 0,8мм, что дает широкие возможности для установки
  Быстрая и недорогая установка, возможность самостоятельного монтажа и демонтажа
  Полный и быстрый прогрев до потолка благодаря инфракрасному обогреву
  Отсутствие дыма и шума
  Возможность использования в сельскохозяйственном и живодноводческом бизнесе
  Строение инфракрасной пленки:
  Карбоновый слой — греющий элемент инфракрасной пленки. Изготавливается из карбоновой пасты по технологии CNT (Carbon Nanotube)
Медная шина — токопроводящая медная шина для подключения электричества, а также передачи его по отрезку инфракрасной пленки.
Антиискровой слой — серебряное покрытие, проводящее электричество от медной шины до карбоновой пасты
Нижний и верхний слой ламинации — защищают все элементы инфракрасной пленки от механических воздействий, влаги и удерживают все элементы инфракрасной пленки
`,
  },
  {
    id: 1,
    image: post_1,
    title: "WARMEHAUS",
    description: `Warmehaus. Wärmehaus GmbH — компания по разработке и производству систем отопления на основе электрических нагревательных кабельных систем. На рынке РБ представлены готовые решения высочайшего качества для комфортного и основного обогрева жилых и промышленных помещений. Также, важным направлением являются системы защиты от снега и льда. 
    Мы предлагаем покупателям широкий ассортимент продукции, в котором представлены электрические системы обогрева полов и основного отопления для помещений, системы антиобледенения, системы антизамерзания кровли, обогрев труб для защиты магистралей от замерзания и многое другое. 
    
    Гарантия на нагревательный кабель и нагревательный мат Wärmehaus Premium составляет 20 лет, на терморегуляторы Wärmehaus Premium 3 года.`,
  },
  {
    id: 2,
    image: post_2,
    title: "GRAND MEYER",
    description: `Безупречная репутация электрических теплых полов Grand Meyer на рынках Европейского союза позволила голландскому бренду теплых полов под плитку произвести настоящий фурор на просторах Таможенного Союза EAC. Электрический теплый пол Grand Meyer — это европейское качество и надежность по революционно низким ценам. Кабельные системы обогрева т.м. Grand Meyer — результат слияния передовых технологий с многолетним опытом производства и эксплуатации кабельных теплых полов.

    Следуя тенденциям современного рынка теплых полов, нагревательный мат Grand Meyer THM180 воплотил в себе все преимущества и инновации двухжильных матов под плитку повышенной мощности. Теплый пол Grand Meyer Heat’n‘Warm EcoNG150 станет идеальным решением для комфортного обогрева, а также для устройства основного отопления в помещениях с хорошей теплоизоляцией. Двухжильные маты Grand Meyer THM180 и Heat’n‘Warm EcoNG150 изготавливаются на передовом производстве в Нидерландах и соответствуют всем европейским требованиям, что подтверждается наличием всех необходимых сертификатов.
    
    Комплект теплого пола под плитку Grand Meyer не предполагает наличие регулятора температуры, поэтому вам необходимо дополнительно купить терморегулятор с датчиком. Чтобы упростить вам задачу, мы предлагаем только проверенные модели терморегуляторов для теплого пола Grand Meyer с оптимальным набором функций. Выбранный нами механический терморегулятор Grand Meyer MST 1 прост и надежен, что является неотъемлемым требованием для устройств данного типа. Для поддержания более точной температуры нагревательного мата для теплого пола и экономии электроэнергии мы предлагаем программируемый терморегулятор Grand Meyer HW 500.
    
    Наш ассортимент включает в себя саморегулирующийся кабель для обогрева кровли и водостоков, теплые полы и терморегуляторы. Продукция торговой марки Grand Meyer® — это высокое качество и умеренные цены. В настоящий момент мы заняты расширением дилерской сети.`,
  },
  // { id: 1, image: img, title: "title", description: "text" },
  // { id: 2, image: img, title: "title", description: "text" },
];

//id Должны быть уникальны!
export const shopData = [
  {
    id: 0,
    images: [warmehaus_wh100],
    title: "WARMEHAUS WH100",
    description: `Непрограммируемый терморегулятор для систем "Теплый пол".`,
    price: 165,
    sale: {
      is: false,
      amount: 0.1,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+50оС" },
      { title: "Максимальная мощность нагрузки", description: "3200W" },
      { title: "Максимальный ток нагрузки", description: "14А" },
      { title: "Степень защиты", description: "IP20" },
    ],
    fullDescription: `Непрограммируемый терморегулятор для систем  "Теплый пол".
      Ручная установка температуры.
      Индикация нагрева.
      LED индикатор состояния :  Красный - режим нагрева.
      Тонкая установочная часть, всего 28мм.
      Пределы регулирования...   +5...+50оС
      Нагрузка до 14А.
      Прибор совместим с рамками  Polo, Elyo, Busch&Jaeger.
      Может быть установлен в комбинации с различными типами выключателей.
      Цвет корпуса: Альпийский белый, Слоновая кость, Белый.
      Все приборы WÄRMEHAUS PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
      Гарантия - 3 года.`,
  },
  {
    id: 1,
    images: [warmehaus_classic_wh700],
    title: "WARMEHAUS CLASSIC WH700",
    description: `Непрограммируемый терморегулятор для систем "Теплый пол".`,
    price: 120,
    sale: {
      is: false,
      amount: 0.1,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+40оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
    ],
    fullDescription: `Непрограммируемый терморегулятор для систем "Теплый пол".
    Ручная установка температуры.
    Индикация нагрева.
    Двухцветный LED индикатор состояния : Зеленый - режим ожидания, Красный - режим нагрева.
    Тонкая установочная часть, всего 24мм.
    Пределы регулирования... +10...+40оС
    Самодиагностика прибора.
    Термозащита. Встроенная защита прибора от перегрева.
    Нагрузка до 16А.
    Прибор совместим с рамками Schneider серия Unica, Simon серия 27 Neos.
    Цвет корпуса: Белый.
    Все приборы Wärmehaus PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 2,
    images: [warmehaus_touchscreen],
    title: "WARMEHAUS TOUCHSCREEN",
    description: `Программируемый Сенсорный 24/7 терморегулятор для систем "Теплый пол".`,
    price: 353,
    sale: {
      is: true,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+60оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
      { title: "Датчик воздуха", description: "есть" },
    ],
    fullDescription: `Программируемый Сенсорный 24/7 терморегулятор для систем "Теплый пол".
    Программирование по дням недели: Рабочий/Выходной день -  5/2 или 6/1 или 7/0.
    Программирование 6-ти временных событий в сутки.
    Два датчика температуры - встроенный и внешний длинной 3м.
    Предназначен для основного или комфортного управления обогревом.
    Режим работы по встроенному датчику - для основного обогрева.
    Режим работы по внешнему датчику - для комфортного обогрева.
    Режим работы по двум датчикам - для основного обогрева. Датчик воздуха (встроенный) - основной. Датчик пола (внешний) - ограничитель.
    Функция экономии энергопотребления.
    Индикация нагрева, отражение текущей и заданной температуры, дня недели и текущего времени.
    Сенсорный активный LED экран.
    Подсветка экрана LED белого цвета.
    Автоматическая блокировка клавиатуры.
    Энергонезависимые часы.
    Функция Антизамерзания .
    Пределы регулирования...   +5...+50оС
    Самодиагностика прибора.
    Ограничение максимальной и минимальной температуры.
    Возможность изменения значения гистерезиса.
    Нагрузка до 16А.
    Цвет корпуса: Белый, Слоновая кость, Серебро, Черный.
    Все приборы WÄRMEHAUS PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 3,
    images: [warmehaus_basic_wh800],
    title: "WARMEHAUS BASIC WH800",
    description: `Непрограммируемый терморегулятор для систем "Теплый пол".`,
    price: 110,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+40оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
    ],
    fullDescription: `Непрограммируемый терморегулятор для систем  "Теплый пол".
    Включение/выключение и установка температуры в одно движение.
    Ручная установка температуры.
    Индикация нагрева.
    Двухцветный LED индикатор состояния : Зеленый - режим ожидания, Красный - режим нагрева.
    Тонкая установочная часть, всего 24мм.
    Пределы регулирования...   +10...+40оС
    Самодиагностика прибора.
    Термозащита. Встроенная защита прибора от перегрева.
    Нагрузка до 16А.
    Прибор совместим с рамками Schneider серия Unica, Simon серия 27 Neos.
    Цвет корпуса: Белый, Слоновая кость.
    Все приборы Warmehaus PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 4,
    images: [warmehaus_wh400_pro],
    title: "WARMEHAUS WH400 PRO",
    description: `Программируемый терморегулятор для систем "Теплый пол".`,
    price: 400,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+40оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
    ],
    fullDescription: `Программируемый терморегулятор для систем  "Теплый пол".
    Цифровое управление теплом.
    Встроенный и внешний/выносной датчики температуры.
    Клеммы подключения проводов  1.5-2.5 мм2
    Принцип управления    ШИМ/ПИ
    Потребление энергии в режиме ожидания    0.5 Вт
    Срок службы резервной батареи   5 лет
    Индикация нагрева.
    Индикация текущей и заданной температуры.
    Высококонтрастный LED СЕНСОРНЫЙ  экран.
    Тонкая установочная часть, всего 22мм.
    Самодиагностика прибора.
    Термозащита. Встроенная защита прибора от перегрева.
    Режим регулировки мощности таймером при работе без датчика температуры.
    Нагрузка до 16А.
    Прибор совместим с рамками ABB, GIRA, JUNG и т.д.).
    Цвет корпуса: Белый.
    Все приборы WÄRMEHAUS PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 5,
    images: [warmehaus_digital_wh900],
    title: "WARMEHAUS DIGITAL WH900",
    description: `Цифровое управление теплом.`,
    price: 175,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+40оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
    ],
    fullDescription: `Цифровое управление теплом.
    Цифровой датчик температуры.
    Индикация нагрева.
    LED индикатор состояния :  Красный в режиме нагрева.
    Высококонтрастный Сегментный LED  индикатор красного цвета.
    Тонкая установочная часть, всего 24мм.
    Возможность использования в системах снеготаяния.
    Самодиагностика прибора.
    Термозащита. Встроенная защита прибора от перегрева.
    Режим регулировки мощности таймером при работе без датчика температуры.
    Нагрузка до 16А.
    Прибор совместим с рамками Schneider серия Unica, Simon серия 27 Neos.
    Цвет корпуса: Белый, Слоновая кость.
    Все приборы Warmehaus PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 6,
    images: [warmehaus_wh500_pro],
    title: "WARMEHAUS WH500 PRO",
    description: `Программируемый термостат “Все в одном” для электрического обогрева пола создает оптимальный комфорт при минимально возможном потреблении энергии.`,
    price: 430,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+40оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
    ],
    fullDescription: `Программируемый термостат “Все в одном” для электрического обогрева пола создает оптимальный комфорт при минимально возможном потреблении энергии.
    Уникальный пользовательский интерфейс с новым меню и сенсорной навигацией для простого программирования и считывания информации.
    Программируемый 24/7 терморегулятор для систем " Теплый пол".
    Программирование по дням недели : Рабочий/Выходной день -  5/2 или 6/1 или 7/0.
    Программирование 4-х или 6-ти временных событий в сутки.
    Энергонезависимые часы. Срок службы резервной батареи для часов и календаря 5 лет
    Функция ручного управления.
    Два датчика : Встроенный и внешний/выносной датчики температуры.
    Функция интеллектуальной экономии энергопотребления "ПРОГНОЗ-ПРЕДВАРИТЕЛЬНЫЙ ПРОГРЕВ".
    Контроль экономии энергопотребления  последних суток/недели/месяца/всего.
    Индикация нагрева, отражение текущей и заданной температуры, дня недели, даты и текущего времени.
    Цветной сенсорный 2" экран.
    Настраиваемая яркость экрана.
    Блокировка клавиатуры , "Защита от детей".
    Тонкая установочная часть, всего 22мм.
    Пределы регулирования +5...+40оС
    Самодиагностика прибора.
    Термозащита. Встроенная защита прибора от перегрева.
    Режим регулировки мощности таймером при работе без датчика температуры (режим процентного регулирования).
    Ограничение максимальной и минимальной температуры воздуха и пола.
    Нагрузка до 16А.
    Прибор совместим с фирменным коробкой-адаптером DK для наружного монтажа.
    Цвет корпуса: Белый, Слоновая кость.
    Все приборы WÄRMEHAUS PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 7,
    images: [warmehaus_wh1000_pro],
    title: "WARMEHAUS WH1000 PRO",
    description: `Программируемый терморегулятор для систем  "Теплый пол".`,
    price: 260,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+45оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
    ],
    fullDescription: `Программируемый терморегулятор для систем  "Теплый пол".
    Цифровое управление теплом.
    Энергонезависимые часы.
    Встроенный и внешний/выносной датчики температуры.
    Функция открытого окна. (При кратковременном проветривании прибор не включит Теплый пол).
    Индикация нагрева.
    Индикация текущей и заданной температуры.
    Высококонтрастный LED  экран с подсветкой белого цвета.
    Режим отъезда. (Теплый пол будет готов к Вашему возвращению из отпуска).
    Тонкая установочная часть, всего 24мм.
    Термозащита. Встроенная защита прибора от перегрева.
    Режим регулировки мощности таймером при работе без датчика температуры.
    Нагрузка до 16А.
    Прибор совместим с рамками Schneider серия Unica, Simon серия 27 (Neos, Play).
    Цвет корпуса: Белый, Слоновая кость.
    Все приборы WÄRMEHAUS PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 8,
    images: [warmehaus_wh600_pro],
    title: "WARMEHAUS WH600 PRO",
    description: `Программируемый терморегулятор для систем  "Теплый пол".`,
    price: 360,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+40оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
      { title: "Датчик воздуха", description: "есть" },
    ],
    fullDescription: `Программируемый терморегулятор для систем  "Теплый пол".
    Система "интеллектуального" управления. (Шим модуляция).
    Цифровое управление теплом.
    Энергонезависимые часы.
    Встроенный и внешний/выносной датчики температуры.
    Индикация нагрева.
    Индикация текущей и заданной температуры.
    Высококонтрастный LED  экран с подсветкой белого цвета.
    Тонкая установочная часть, всего 20мм.
    Термозащита. Встроенная защита прибора от перегрева.
    Режим регулировки мощности таймером при работе без датчика температуры.
    Нагрузка до 16А.
    Прибор совместим с рамками ABB, GIRA, JUNG и др.
    Цвет корпуса: Белый Альпийский.
    Все приборы WÄRMEHAUS PREMIUM обеспеченны полноценной трехлетней гарантией, инструкцией на русском языке и сервисной поддержкой.
    Гарантия - 3 года.`,
  },
  {
    id: 9,
    images: [warmehaus_digital_wh300],
    title: "WARMEHAUS DIGITAL WH300",
    description: `Программируемый терморегулятор для систем  "Теплый пол".`,
    price: 330,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Пределы регулирования", description: "+5...+40оС" },
      { title: "Максимальная мощность нагрузки", description: "3600W" },
      { title: "Максимальный ток нагрузки", description: "16А" },
      { title: "Степень защиты", description: "IP20" },
      { title: "Wi-Fi", description: "есть" },
    ],
    fullDescription: `Программируемый сенсорный цифровой терморегулятор для "Теплого пола".
    Удобное управление терморегулятором прямо через приложение или из браузера.
    Цифровое управление теплом.
    Полностью программируемый прибор с недельным управлением.
    Вы сможете одним прикосновением к экрану своего смартфона прекратить нагрев на определенное время или выключить полностью. Задать время старта. При этом прибор автоматически включит теплый пол по истечению заданного времени. Этот режим удобен, например, тогда когда вы уезжаете в отпуск и точно знаете когда возвращаетесь домой. А пока Вы на работе или на ночь, можно воспользоваться программой которая автоматически будет поддерживать комфортную температуру. Удобство заключается в том, что Вам не понадобится включать нагрев по приходе с работы или утром, после сна. Прибор включит теплый пол автоматически, когда вы проснулись и выключит когда вы уходите из дома. Рекомендуем устанавливать температуру в отсутствии вас дома на 2-4 градуса ниже чем комфортная температура в остальное время, пока вы бодрствуете и находитесь дома.
    Редактирование программ происходит очень просто и уже через несколько секунд прибор получает новые заданные установки. Управление прибором осуществляется из любой точки Мира где есть интернет.
    Функция самодиагностики.
    Термозащита. Встроенная защита прибора от перегрева.
    Тонкая установочная часть, всего 24мм.
    Режим регулировки мощности таймером при работе без датчика температуры.`,
  },
  {
    id: 10,
    images: [
      warmehaus_mat_160w_standart_plus,
      warmehaus_mat_160w_standart_plus_0,
    ],
    title: "WARMEHAUS MAT 160W STANDART PLUS",
    description: `Тонкий нагревательный мат на сетке, с кабелем диаметром 3мм`,
    price: 210,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Диаметр", description: "3мм" },
      { title: "Экранированный", description: "да" },
      { title: "Армированный", description: "да" },
    ],
    fullDescription: `Мат изготовлен на основе резистивного нагревательного кабеля.

    WARMEHAUS® MAT 160W/m2 - тонкий двужильный нагревательный мат на сетке, с шагом кабеля 7см и диаметром 3мм.
    
    Армированный, экранированный, двужильный нагревательный кабель на сетке с двойной изоляцией, с холодным проводом длиной 3,5м, с герметичными армированной переходной и концевой муфтами.
    
    Укладывается в слой клея или тонкий слой самовыравнивающегося раствора непосредственно под финишное покрытие пола.
    
    В основе работы резистивного нагревательного кабеля лежит свойство проводника с повышенным сопротивлением выделять тепло. Количество выделяемого тепла зависит от сопротивления. В конструкции кабеля применена прогрессивная технология с двумя нагревательными жилами, т.е. без возвратного токопроводящего проводника. Что способствует равномерному прогреву кабеля,  позволяет уменьшить диаметр кабеля на мате до 3мм и увеличить срок службы системы.  Нагревательным элементом служат сами токопроводящие жилы, изготовленные из металлического сплава и покрытые стойкой к высоким температурам изоляцией.
    
    `,
  },
  {
    id: 11,
    images: [warmehaus_mat_200w_pro, warmehaus_mat_200w_pro_0],
    title: "WARMEHAUS MAT 200W PRO",
    description: `Тонкий нагревательный мат на сетке, с кабелем диаметром 3мм`,
    price: 290,
    sale: {
      is: false,
      amount: 0.05,
    },
    manufacturer: {
      image: warmehaus,
      title: "WARMEHAUS",
    },
    info: [
      { title: "Диаметр", description: "3мм" },
      { title: "Экранированный", description: "да" },
      { title: "Армированный", description: "да" },
    ],
    fullDescription: `WÄRMEHAUS® MAT 200W/m2 Германия - армированный экранированный двухжильный нагревательный мат толщиной 3,0мм.Применяется на том этапе строительства, когда стяжка полов уже сделана. Укладывается в слой клея (не более 10мм) или тонкий слой самовыравнивающегося раствора непосредственно под финишное покрытие пола, без стяжки.Предназначен для установки в ремонтируемых и "тонких" полах непосредственно под покрытие пола без формирования толстой цементной стяжки и устанавливается в основном под плитку в плиточный клей.

    Высокая удельная мощность 200Вт/м2 позволяет не только достичь комфортной 24...26С˚ температуры пола даже в межсезонье, но и проектировать системы отопления для основного обогрева.Сплошной экран из алюминиевой фольги, луженая медная шина заземления и двухжильная конструкция кабеля полностью защищают от ЭМ излучения.*Рекомендовано для комфортного подогрева поверхности в помещениях с повышенной влажностью, санузлах, ванных комнатах или основного обогрева жилых помещений.*Допускается использование в помещениях с повышенными теплопотерями, например в хорошо утепленных лоджиях и верандах в качестве основного обогрева.Идеальное решение** для комфортного/дополнительного обогрева поверхности  в помещениях с повышенной влажностью или основного обогрева жилых помещений.
    
    **- монтаж кабеля в слой плиточного клея не более 1см.
        
    `,
  },
  {
    id: 12,
    images: [grand_meyer_heatnwarm_econg150, grand_meyer_heatnwarm_econg150_0],
    title: "GRAND MEYER Heat’n’Warm EcoNG150",
    description: `Нагревательный мат под плитку.`,
    price: 124,
    sale: {
      is: true,
      amount: 0.1,
    },
    manufacturer: {
      image: grand_meyer,
      title: "GRAND MEYER",
    },
    info: [
      { title: "Диаметр", description: "3,8мм" },
      { title: "Напряжение", description: "230V" },
      { title: "Удельная мощность мата", description: "150 Ватт/м2" },
    ],
    fullDescription: `Теплый пол используется как дополнительная система обогрева в помещениях с центральным отоплением, также в случае необходимости теплый пол может использоваться и в качестве основного источника тепла.

    Теплый пол в качестве основного источника тепла применяется в тех случаях, когда в квартиру или коттедж невозможно провести центральное отопление. Теплые полы могут укладываться в слой плиточного клея или непосредственно в стяжку.
    
    Электрические теплые полы имеют ряд преимуществ перед другими системами отопления:
    
    простой монтаж системы, не требующий специальных устройств и приспособлений;
    долговечность системы, теплые полы прослужат 50 и более лет;
    теплый пол не мешает и не занимает места, в отличие от прочих нагревательных приборов;
    теплый пол создает комфортную атмосферу равномерного тепла в комнате, в отличие от конвекционных обогревателей;
    использование современных материалов, делает теплый пол безопасным и снижает уровень    излучения до естественного фона;
    теплый пол экономичен за счет использования терморегуляторов и датчиков температуры.
    Нагревательный мат представляет собой тонкий нагревательный элемент, который волнообразно закреплен на стекловолоконной сетке шириной 50 см и длиной до 3000 см, в зависимости от типа и предназначен для укладки в слой кафельного клея. Кабель изготовлен с применением высококачественной термостойкой изоляции и защищен экраном. Для подключения мата к сети служит холодный провод длиной 3 метра. Удельная мощность мата составляет 150 Ватт/м2 при напряжении сети 230 Вольт. Диаметр сечения провода 3,8 мм.
    `,
  },
  {
    id: 13,
    images: [grand_meyer_thc20, grand_meyer_thc20_0],
    title: "Двужильный кабель GRAND MEYER THC20",
    description: `Двужильный нагревательный кабель в стяжку.`,
    price: 167,
    sale: {
      is: false,
      amount: 0.1,
    },
    manufacturer: {
      image: grand_meyer,
      title: "GRAND MEYER",
    },
    info: [
      { title: "Диаметр", description: "5мм" },
      { title: "Прогонная мощность", description: "20 Ватт/м" },
    ],
    fullDescription: `Теплый пол используется как дополнительная система обогрева в помещениях с центральным отоплением, также в случае необходимости теплый пол может использоваться и в качестве основного источника тепла.

    Теплый пол в качестве основного источника тепла применяется в тех случаях, когда в квартиру или коттедж невозможно провести центральное отопление. Теплые полы могут укладываться в слой плиточного клея или непосредственно в стяжку.
    
    Электрические теплые полы имеют ряд преимуществ перед другими системами отопления:
    
    простой монтаж системы, не требующий специальных устройств и приспособлений;
    долговечность системы, теплые полы прослужат 50 и более лет;
    теплый пол не мешает и не занимает места, в отличие от прочих нагревательных приборов;
    теплый пол создает комфортную атмосферу равномерного тепла в комнате, в отличие от конвекционных обогревателей;
    использование современных материалов, делает теплый пол безопасным и снижает уровень    излучения до естественного фона;
    теплый пол экономичен за счет использования терморегуляторов и датчиков температуры.
    Двужильный нагревательный кабель диаметром 5,0 мм и мощностью 20 Ватт на погонный метр предназначен для укладки в стяжку. Свойства кабеля позволят Вам легко обойти препятствия, покрывая все свободные зоны пола. Нагревательный кабель пригоден для обогрева любых помещений, в том числе жилых, офисных, производственных.
    `,
  },
];
