CREATE TABLE dbo.Товары (
    #     [Номер товара] INTEGER PRIMARY KEY,
    #     [Название товара] TEXT NOT NULL,
    #     [Кол-во товара на складе] INTEGER NOT NULL,
    #     [Цена в рублях] REAL NOT NULL,
    #     [Единицы измерения] TEXT NOT NULL
    # )
    # INSERT INTO dbo.Товары([Номер товара], [Название товара], [Кол-во товара на складе], [Цена в рублях], [Единицы измерения]) VALUES (1, N'Багет', 200, 1.8, N'штук')
    # INSERT INTO dbo.Товары([Номер товара], [Название товара], [Кол-во товара на складе], [Цена в рублях], [Единицы измерения]) VALUES (2, N'Нож', 9, 20.85, N'штук')
    # INSERT INTO dbo.Товары([Номер товара], [Название товара], [Кол-во товара на складе], [Цена в рублях], [Единицы измерения]) VALUES (3, N'Тапки', 21, 10.5, N'штук')
    # CREATE TABLE dbo.Заказы (
    #     [Дата продажи] DATE PRIMARY KEY,
    #     [Номер покупателя] INTEGER FOREIGN KEY REFERENCES dbo.Клиенты([Номер покупателя]),
    #     [Номер товара] INTEGER FOREIGN KEY REFERENCES dbo.Товары([Номер товара]),
    #     [Кол-во заказаного товара] INTEGER NOT NULL,
    #     Скидка REAL NOT NULL
    # )
    # INSERT INTO dbo.Заказы([Дата продажи], [Номер покупателя], [Номер товара], [Кол-во заказаного товара], Скидка) VALUES (11052021, 1, 1, 1, 0.02)
    # INSERT INTO dbo.Заказы([Дата продажи], [Номер покупателя], [Номер товара], [Кол-во заказаного товара], Скидка) VALUES (21092022, 2, 2, 2, 0.2)
    # INSERT INTO dbo.Заказы([Дата продажи], [Номер покупателя], [Номер товара], [Кол-во заказаного товара], Скидка) VALUES (07072021, 3, 3, 10, 0.1)
    # CREATE TABLE dbo.Скидки (
    #     [Номер покупателя] INTEGER PRIMARY KEY REFERENCES dbo.Клиенты([Номер покупателя]),
    #     Скидка REAL NOT NULL
    # )
    # INSERT INTO dbo.Скидки([Номер покупателя], Скидка) VALUES (1, 0.02)
    # INSERT INTO dbo.Скидки([Номер покупателя], Скидка) VALUES (2, 0.2)
    # INSERT INTO dbo.Скидки([Номер покупателя], Скидка) VALUES (3, 0.1)
    # """